Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: Compound statements
ru: Составные инструкции

source: Compound statements contain (groups of) other statements; they affect or control the execution of those other statements in some way. In general, compound statements span multiple lines, although in simple incarnations a whole compound statement may be contained in one line.
ru: Составные инструкции содержат другие инструкции или их группы. Они влияют, или прямо контролируют исполнение содержащихся инструкций каким-либо образом. Как правило составные инструкции состоят из нескольких строк, однако в простых выражениях составная инструкция может целиком размещаться в одной строке.

source: The :keyword:`if`, :keyword:`while` and :keyword:`for` statements implement traditional control flow constructs. :keyword:`try` specifies exception handlers and/or cleanup code for a group of statements, while the :keyword:`with` statement allows the execution of initialization and finalization code around a block of code. Function and class definitions are also syntactically compound statements.
ru: Инструкции «:keyword:`if`», «:keyword:`while`» и «:keyword:`for`» реализуют стандартные конструкции управления потоком исполнения. «:keyword:`try`» определяет для определённой группы выражений обработчик исключения и/или код ликвидации последствий, тогда как инструкция «:keyword:`with`» позволяет исполнять инициализирующий и завершающий код соответственно до и после определённого кода. Определения функций и классов синтаксически также являются составными инструкциями

source: Compound statements consist of one or more 'clauses.' A clause consists of a header and a 'suite.' The clause headers of a particular compound statement are all at the same indentation level. Each clause header begins with a uniquely identifying keyword and ends with a colon. A suite is a group of statements controlled by a clause. A suite can be one or more semicolon-separated simple statements on the same line as the header, following the header's colon, or it can be one or more indented statements on subsequent lines. Only the latter form of suite can contain nested compound statements; the following is illegal, mostly because it wouldn't be clear to which :keyword:`if` clause a following :keyword:`else` clause would belong::
ru: Составные инструкции состоят из одной или более «групп» . Группа состоит из «заголовка» и «содержимого» . Все «заголовки» групп одной составной инструкции находятся на одном уровне отступов. Каждый «заголовок» группы начинается с однозначно идентифицирующего ключевого слова и заканчивается двоеточием. Инструкции «содержимого» являются подконтрольными в группе . «Содержимое» может быть одной или более простыми инструкциями разделенными точкой с запятой в той же строке, что и «заголовок» , после двоеточия «заголовка» , или же может быть одной или более инструкций, идущих в отдельных строках с отступом. Только последняя форма содержимого группы может содержать вложенные составные инструкции. Следующий пример недопустим, главным образом потому, что не ясно, группе которого «:keyword:`if`» будет относиться группа следующего «:keyword:`else`» ::

source: Also note that the semicolon binds tighter than the colon in this context, so that in the following example, either all or none of the :func:`print` calls are executed::
ru: К тому же, заметьте, что (в данном контексте) точка-с-запятой связывается сильнее, чем двоеточие, таким образом в следующем примере исполняются или все инструкции «:func:`print`» , или ни одной ::

source: Summarizing:
ru: В итоге :

source: Note that statements always end in a ``NEWLINE`` possibly followed by a ``DEDENT``. Also note that optional continuation clauses always begin with a keyword that cannot start a statement, thus there are no ambiguities (the 'dangling :keyword:`else`' problem is solved in Python by requiring nested :keyword:`if` statements to be indented).
ru: Заметьте, что инструкции всегда заканчиваются признаком «``NEWLINE``» , после которого может идти «``DEDENT``» . Также отметьте, что необязательные ветви в условиях всегда начинаются с такого ключевого слова, по которому ясно, что это именно продолжение инструкции необязательною ветвью, и с этого слова не может начинаться новая инструкция. Проблема “оторванных” «:keyword:`else`» решена в Питоне через обязательность отступов для вложенных «:keyword:`if`» .

source: The :keyword:`if` statement
ru: Инструкция «:keyword:`if`»

source: The :keyword:`if` statement is used for conditional execution:
ru: Инструкция «:keyword:`if`» служит для исполнения по условию :

source: It selects exactly one of the suites by evaluating the expressions one by one until one is found to be true (see section :ref:`booleans` for the definition of true and false); then that suite is executed (and no other part of the :keyword:`if` statement is executed or evaluated). If all expressions are false, the suite of the :keyword:`else` clause, if present, is executed.
ru: Инструкция «:keyword:`if`» выбирает только одну вложенную группу инструкций, вычисляя выражения-условия по очереди до первого со значением «:keyword:`True`» (смотрите раздел «Логические (булевы) операции» :ref:`booleans` ) , затем соответствующая вложенная группа исполняется (и больше не вычисляются другие выражения-условия и не выполняются другие группы) . Если все выражения-условия имеют значение «:keyword:`False`» , то вложенная группа ветви «:keyword:`else`» выполняется, если присутствует.

source: The :keyword:`while` statement
ru: Инструкция «:keyword:`while`»

source: The :keyword:`while` statement is used for repeated execution as long as an expression is true:
ru: Инструкция «:keyword:`while`» используется для циклического исполнения пока выражение истинно :

source: This repeatedly tests the expression and, if it is true, executes the first suite; if the expression is false (which may be the first time it is tested) the suite of the :keyword:`else` clause, if present, is executed and the loop terminates.
ru: Инструкция «:keyword:`while`» циклически проверяет выражение-условие, и если оно истинно – выполняет первую вложенную группу, а если оно ложно – (даже если это происходит при первой же проверке) цикл завершается и вложенная группа ветви «:keyword:`else`» выполняется, если присутствует.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and goes back to testing the expression.
ru: Исполнение инструкции «:keyword:`break`» в первой группе прекращает цикл без исполнения ветви «:keyword:`else`» . Инструкция «:keyword:`continue`» в первой группе пропускает остаток этой группы, и происходит переход обратно к проверке выражения-условия.

source: The :keyword:`for` statement
ru: Инструкция «:keyword:`for`»

source: The :keyword:`for` statement is used to iterate over the elements of a sequence (such as a string, tuple or list) or other iterable object:
ru: Инструкция «:keyword:`for`» используется для того, чтобы перебирать последовательно элементы последовательности (например текстовые данные, «кортежи» , списки) или другого перечислимого объекта :

source: The expression list is evaluated once; it should yield an iterable object. An iterator is created for the result of the ``expression_list``. The suite is then executed once for each item provided by the iterator, in the order of ascending indices. Each item in turn is assigned to the target list using the standard rules for assignments (see :ref:`assignment`), and then the suite is executed. When the items are exhausted (which is immediately when the sequence is empty or an iterator raises a :exc:`StopIteration` exception), the suite in the :keyword:`else` clause, if present, is executed, and the loop terminates.
ru: Список выражений «``expression_list``» вычисляется только один раз – он должен давать в результате итерируемый объект, для которого создаётся итератор. Вложенный блок затем исполняется по одному разу для каждого элемента, выданного итератором в порядке увеличения индексов. Каждый такой выданный итератором элемент назначается списку целей в соответствии со стандартными правилами назначения (смотрите раздел «Инструкции назначения» :ref:`assignment`) , и затем уже́ вложенный блок исполняется. Когда эти элементы кончаются (в самом начале, если последовательность пустая, или когда итератор инициирует исключение «:exc:`StopIteration`» ) , то исполняется блок инструкций ветви «:keyword:`else`» , если таковая присутствует, и цикл прекращается.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and continues with the next item, or with the :keyword:`else` clause if there was no next item.
ru: Инструкция «:keyword:`break`» , исполненная в основной ветви («:keyword:`for`») , прекращает цикл без исполнения ветви «:keyword:`else`» . Инструкция «:keyword:`continue`» , исполненная в основной ветви («:keyword:`for`») , пропускает оставшиеся инструкции блока и, если итерируемые элементы ещё есть – переходит к новому исполнению блока со следующим элементом, а иначе переходит к ветви «:keyword:`else`» .

source: The suite may assign to the variable(s) in the target list; this does not affect the next item assigned to it.
ru: Внутри вложенного блока можно изменять значение переменных из списка целей, и это ни как не повлияет на их значение, когда при следующем проходе им будет назначено значение очередного элемента.

source: Names in the target list are not deleted when the loop is finished, but if the sequence is empty, it will not have been assigned to at all by the loop. Hint: the built-in function :func:`range` returns an iterator of integers suitable to emulate the effect of Pascal's ``for i := a to b do``; e.g., ``list(range(3))`` returns the list ``[0, 1, 2]``.
ru: Имена из списка целей не удаляются после окончания цикла, но, если последовательность пустая, то этим именам вообще не будет назначено значение (и, если переменные не существовали, то и не будут созданы) . Подсказка : встроенная функция «:func:`range`» возвращает итератор целых чисел, который можно использовать для эмулирования эффекта Паскалевского «``for i := a to b do``» , например, «``list(range(3))``» возвращает список «``[0, 1, 2]``» .

source: There is a subtlety when the sequence is being modified by the loop (this can only occur for mutable sequences, i.e. lists). An internal counter is used to keep track of which item is used next, and this is incremented on each iteration. When this counter has reached the length of the sequence the loop terminates. This means that if the suite deletes the current (or a previous) item from the sequence, the next item will be skipped (since it gets the index of the current item which has already been treated). Likewise, if the suite inserts an item in the sequence before the current item, the current item will be treated again the next time through the loop. This can lead to nasty bugs that can be avoided by making a temporary copy using a slice of the whole sequence, e.g., ::
ru: Есть тонкость, когда итерируемая последовательность изменяется внутри цикла (это может произойти только с изменяемыми последовательностями, например списком) . Для отслеживания того, какой элемент будет использован следующим, – используется внутренний счётчик, увеличиваемый на единицу при каждом проходе. Когда он достигает длинны последовательности – цикл прекращается. Это значит, что если внутри блока цикла удаляется текущий (или один из предыдущих) элемент последовательности, то элемент, который должен был быть выдан следующим будет пропущен, поскольку он получит индекс элемента, обрабатываемого в данный момент. Таким же образом, если внутри блока цикла в последовательность добавляется элемент до текущего элемента, то текущий элемент будет обработан ещё раз на следующем проходе цикла. Это может приводить к очень неприятным ошибкам, которых можно избежать, если для последовательности делать временную копию, с помощью среза всей последовательности, например : ::

source: The :keyword:`try` statement
ru: Инструкция «:keyword:`try`»

source: The :keyword:`try` statement specifies exception handlers and/or cleanup code for a group of statements:
ru: Инструкция «:keyword:`try`» задаёт обработчики исключения и/или завершающий код для блока инструкций :

source: The :keyword:`except` clause(s) specify one or more exception handlers. When no exception occurs in the :keyword:`try` clause, no exception handler is executed. When an exception occurs in the :keyword:`try` suite, a search for an exception handler is started. This search inspects the except clauses in turn until one is found that matches the exception. An expression-less except clause, if present, must be last; it matches any exception. For an except clause with an expression, that expression is evaluated, and the clause matches the exception if the resulting object is "compatible" with the exception. An object is compatible with an exception if it is the class or a base class of the exception object or a tuple containing an item compatible with the exception.
ru: Ветвь «:keyword:`except`» задаёт один или более обработчиков исключений. Если не происходит ни одного исключения в соответствующей ветви «:keyword:`try`» , то никакой из этих обработчиков не вызывается. Когда случается какое-либо исключение в соответствующей ветви «:keyword:`try`» , то начинается поиск обработчика этого исключения. При этом поиске просматриваются последовательно все блоки «:keyword:`except`» пока не встретится первый блок соответствующий произошедшему исключению. Если задан блок «:keyword:`except`» без указания исключения , который подразумевает любое исключение, то его логично указывать последним. Для инструкции «:keyword:`except`» с выражением – это выражение вычисляется, и если объект-результат является “совместимым” с обрабатываемым исключением, то данный блок «:keyword:`except`» соответствует данному исключению. Объект совместим с данным исключением, если он является классом или базовым классом данного исключения, или же является кортежем, содержащим объект, совместимый с данным исключением.

source: If no except clause matches the exception, the search for an exception handler continues in the surrounding code and on the invocation stack. [#]_
ru: Если не найдено ни одного блока «:keyword:`except`» , соответствующего исключению, то поиск продолжается в окружающем коде и по стеку вызовов. [#]_ Исключение передаётся вверх по стеку вызовов только если отсутствует блок «:keyword:`finally`» , такой, который нейтрализует данное исключение.

source: If the evaluation of an expression in the header of an except clause raises an exception, the original search for a handler is canceled and a search starts for the new exception in the surrounding code and on the call stack (it is treated as if the entire :keyword:`try` statement raised the exception).
ru: Если при вычислении выражения у само́й инструкции «:keyword:`except`» возникает исключение, то обработка текущего исключения (возникшего внутри блока «:keyword:`try`» , к которому относится данная инструкция «:keyword:`except`» ) отменяется, и начинается поиск обработчика для этого нового исключения в объемлющем коде и по стеку вызовов (тоесть, считается, что исключение вызвала вся конструкция «:keyword:`try`» ) .

source: When a matching except clause is found, the exception is assigned to the target specified after the :keyword:`as` keyword in that except clause, if present, and the except clause's suite is executed. All except clauses must have an executable block. When the end of this block is reached, execution continues normally after the entire try statement. (This means that if two nested handlers exist for the same exception, and the exception occurs in the try clause of the inner handler, the outer handler will not handle the exception.)
ru: Если найдена соответствующая ветвь «:keyword:`except`» , то внутри этой ветви данное исключение назначается получателю, указанному после ключевого слова «:keyword:`as`» , если таковое присутствует, и затем блок кода этой ветви «:keyword:`except`» исполняется. Все ветви «:keyword:`except`» должны иметь исполнимый блок. Когда исполнение этого блока завершается – обработка данного исключения завершена, и исполнение продолжается уже́ обычным образом после всей конструкции «:keyword:`try`» . (Это также значит, что если есть два вложенных обработчика для одного вида исключения, то когда оно происходит внутри внутренней ветви «:keyword:`try`» – внешний обработчик не получит этого исключения.)

source: When an exception has been assigned using ``as target``, it is cleared at the end of the except clause. This is as if ::
ru: Если исключение назначается переменной, указанной после ключевого слова «:keyword:`as`» , то эта переменная автоматически удаляется при завершении этого блока «:keyword:`except`» , как если бы ::

source: was translated to ::
ru: транслировалось в ::

source: This means the exception must be assigned to a different name to be able to refer to it after the except clause. Exceptions are cleared because with the traceback attached to them, they form a reference cycle with the stack frame, keeping all locals in that frame alive until the next garbage collection occurs.
ru: Из этого следует, что если нужно иметь возможность обращаться к данному объекту-исключению после завершения блока «:keyword:`except`» , то нужно назначить это исключение ещё какому-либо имени. Причиной этого является то, что исключения со связанной с ними трассировкой образуют циклические ссылки с кадром стека, из-за чего все локальные переменные в этом кадре будут сохраняться до следующего сбора мусора.

source: Before an except clause's suite is executed, details about the exception are stored in the :mod:`sys` module and can be access via :func:`sys.exc_info`. :func:`sys.exc_info` returns a 3-tuple consisting of: ``exc_type``, the exception class; ``exc_value``, the exception instance; ``exc_traceback``, a traceback object (see section :ref:`types`) identifying the point in the program where the exception occurred. :func:`sys.exc_info` values are restored to their previous values (before the call) when returning from a function that handled an exception.
ru: Перед исполнением блока кода ветви «:keyword:`except`» информация об исключении записывается в модуль «:mod:`sys`» и её можно получить с помощью «:func:`sys.exc_info`» . «:func:`sys.exc_info`» возвращает тройной кортеж, содержащий : «``exc_type``» – класс данного исключения; «``exc_value``» – экземпляр исключения; «``exc_traceback``» – объект трассировки (смотрите раздел об иерархии стандартных типов :ref:`types`) указывающий место программы, в котором произошло исключение. Значения «:func:`sys.exc_info`» восстанавливаются в их предыдущее значение при возвращении из функции обработки исключения.

source: The optional :keyword:`else` clause is executed if and when control flows off the end of the :keyword:`try` clause. [#]_ Exceptions in the :keyword:`else` clause are not handled by the preceding :keyword:`except` clauses.
ru: Необязательная ветвь «:keyword:`else`» исполняется только если и когда происходит выход из блока «:keyword:`try`» в связи с его исчерпанием, а не в связи с исключением или исполнением инструкций «:keyword:`return`» , «:keyword:`continue`» или «:keyword:`break`» . [#]_ Исключения в такой ветви «:keyword:`else`» не обрабатываются идущими перед нею ветвями «:keyword:`except`» (относящимися к той же конструкции «:keyword:`try`») , а являются исключением, возникшим в целой этой конструкции «:keyword:`try`» (и обрабатываются во внешнем коде) .

source: If :keyword:`finally` is present, it specifies a 'cleanup' handler. The :keyword:`try` clause is executed, including any :keyword:`except` and :keyword:`else` clauses. If an exception occurs in any of the clauses and is not handled, the exception is temporarily saved. The :keyword:`finally` clause is executed. If there is a saved exception, it is re-raised at the end of the :keyword:`finally` clause. If the :keyword:`finally` clause raises another exception or executes a :keyword:`return` or :keyword:`break` statement, the saved exception is lost. The exception information is not available to the program during execution of the :keyword:`finally` clause.
ru: Если присутствует ветвь «:keyword:`finally`» , то она определяет завершающий (зачищающий) обработчик. Выполняется ветвь «:keyword:`try`» , а также все ветви «:keyword:`except`» и «:keyword:`else`» . Если в любой из них происходит исключение, и оно не обработано, то оно временно сохраняется. Затем выполняется ветвь «:keyword:`finally`» . Затем, если было сохранено исключение, оно вызывается заново по завершении ветви «:keyword:`finally`» . Если в ветви «:keyword:`finally`» происходит исключение или исполняется инструкция «:keyword:`return`» или «:keyword:`break`» , то сохранённое исключение теряется. Информация об сохранённом исключении не доступна программе во время исполнения ветви «:keyword:`finally`» .

source: When a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement is executed in the :keyword:`try` suite of a :keyword:`try`...\ :keyword:`finally` statement, the :keyword:`finally` clause is also executed 'on the way out.' A :keyword:`continue` statement is illegal in the :keyword:`finally` clause. (The reason is a problem with the current implementation --- this restriction may be lifted in the future).
ru: Если в ветви «:keyword:`try`» исполняется инструкция «:keyword:`return`» или «:keyword:`break`» , то ветвь «:keyword:`finally`» тоже исполняется перед выходом из всей конструкции «:keyword:`try`...finally» . В ветви «:keyword:`finally`» инструкция «:keyword:`continue`» недопустима. (Проблема в текущей реализации – это ограничение может быть снято в будущем.)

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information on using the :keyword:`raise` statement to generate exceptions may be found in section :ref:`raise`.
ru: Дополнительная информация об исключениях есть в разделе “Исключения” :ref:`exceptions` , а об использовании инструкции «:keyword:`raise`» для вызова исключений – в разделе “Инструкция «raise»” :ref:`raise` .

source: The :keyword:`with` statement
ru: Инструкция «:keyword:`with`»

source: The :keyword:`with` statement is used to wrap the execution of a block with methods defined by a context manager (see section :ref:`context-managers`). This allows common :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` usage patterns to be encapsulated for convenient reuse.
ru: Инструкция «:keyword:`with`» используется для “оборачивания” исполнения блока методами, определёнными менеджером контекста (смотрите раздел “Менеджеры контекста инструкции «:keyword:`with`» ” :ref:`context-managers` ) . Это позволяет общим схемам использования «:keyword:`try`...\ :keyword:`except`...\ :keyword:`finally`» быть инкапсулированными для удобного повторного использования.

source: The execution of the :keyword:`with` statement with one "item" proceeds as follows:
ru: Исполнение инструкции «:keyword:`with`» с одним “элементом” происходит так:

source: The context expression is evaluated to obtain a context manager.
ru: Выражение контекста («:token:`with_item`») вычисляется, чтобы получить менеджер контекста.

source: The context manager's :meth:`__enter__` method is invoked.
ru: Вызывается метод «:meth:`__enter__`» этого менеджера контекста.
